// Вариант 4
#include <iostream>
#include <math.h>
#include <conio.h>
#include <stdlib.h>

using namespace std;

//int sort(const void* a, const void* b)//алгоритм сортировки
//{
//	return (*(int*)a - *(int*)b);
//}

// Лаб. 5 Задание 4
/*----------------------------------------------------------------------------------------------------------------*/
//int main()
//{
//	// определение переменных
//	int n, m, i, j, k, l;
//	int mn = 0;
//	// подключаем рандом и задаем размерность массива
//	cout << "m=";
//	cin >> m;
//	cout << "n=";
//	cin >> n;
//	// создаем динамический массив
//	int** a, ** tmp;
//
//	a = new int* [m];
//	for (i = 0; i < m; i++)
//		a[i] = new int[n];
//
//	tmp = new int* [m];
//	for (i = 0; i < m; i++)
//		tmp[i] = new int[n];
//
//	// рандомим и печатаем его
//	cout << "Ishodnaya Matrica" << endl;
//	for (i = 0; i < m; i++)
//	{
//		for (j = 0; j < n; j++)
//		{
//			a[i][j] = rand() % 20;
//			cout << a[i][j] << "\t";
//			if (j == n - 1) { cout << "\n"; }
//		}
//	}
//
//	for (i = 0; i < m; i++)
//		for (j = 0; j < n; j++)
//		{
//			tmp[i][j] = a[0][0];
//			for (k = 0; k < i; k++)
//				for (l = 0; l < j; l++)
//					if (tmp[i][j] > a[k][j]) tmp[i][j] = a[k][l];
//		}
//	cout << endl;;
//
//	// выводим получившуюся матрицу на экран
//	cout << "Rezultat" << endl;
//	for (i = 0; i < m; i++)
//	{
//		for (j = 0; j < n; j++)
//		{
//			cout << tmp[i][j] << "\t";
//			if (j == n - 1) cout << "\n";
//		}
//	}
//
//	//очищаем область памяти
//	for (i = 0; i < m; i++)
//	{
//		delete[] a[i];
//		delete[] tmp[i];
//	}
//	delete[] a;
//	delete[] tmp;
//
//	return 0;
//}
/*----------------------------------------------------------------------------------------------------------------*/

// Лаб. 5 Задание 3
/*----------------------------------------------------------------------------------------------------------------*/
//int main()
//{
//	setlocale(LC_ALL, "Russian");
//
//	const int n = 4, m = 5;
//	int arr[n][m] = {}, k = 0;
//
//	for (int i = 0; i < n; i++)
//	{
//		for (int j = 0; j < m; j++)
//		{
//			arr[i][j] = (rand() % 21);
//		}
//	}
//
//	for (int i = 0; i < n; i++)
//	{
//		for (int j = 0; j < m; j++)
//		{
//			cout << arr[i][j] << " ";
//		}
//		cout << endl;
//	}
//
//	cout << "Введите строку которую вы хотите удалить: ";
//	cin >> k;
//
//	for (int i = 0; i < n; i++)
//	{
//		for (int j = 0; j < m; j++)
//		{
//			if (i != (k - 1))
//			{
//				cout << arr[i][j] << " ";
//			}
//		}
//		cout << endl;
//	}
//
//	return 0;
//}
/*----------------------------------------------------------------------------------------------------------------*/

// Лаб. 5 Задание 2
/*----------------------------------------------------------------------------------------------------------------*/
//int main()
//{
//	setlocale(LC_ALL, "Russian");
//
//    const int m = 3, n = 3;
//    int a[m][n] = {}, i, j, k = 0;
//    for (i = 1; i <= m; i++)
//    {
//        for (j = 1; j <= n; j++)
//            cin >> a[i][j];
//    }
//
//    for (i = 1; i <= m - 1; i++)
//    {
//        for (j = 1; j <= n; j++)
//        {
//            if (a[i][0] != a[i][j])
//            {
//                k++;
//                break;
//            }
//        }
//    }
//    cout << "\n" << k;
//
//	return 0;
//}
/*----------------------------------------------------------------------------------------------------------------*/

// Лаб. 5 Задание 1
/*----------------------------------------------------------------------------------------------------------------*/
//int main()
//{
//	setlocale(LC_ALL, "Russian");
//
//	const int n = 4, m = 5;
//	int arr[n][m] = {}, sum = 0;
//
//	for (int i = 0; i < n; i++)
//	{
//		for (int j = 0; j < m; j++)
//		{
//			cout << "Введите элемент массива [" << i + 1 << "][" << j + 1 << "]: ";
//			cin >> arr[i][j];
//		}
//	}
//
//	for (int i = 0; i < n; i++)
//	{
//		for (int j = 0; j < m; j++)
//		{
//			if (j % 2 == 0)
//			{
//				sum += arr[i][j];
//			}
//		}
//	}
//
//	cout << "Сумма элементов всех ее четных столбцов равна: " << sum;
//
//	return 0;
//}
/*----------------------------------------------------------------------------------------------------------------*/

// Лаб. 4 Задание 4
/*----------------------------------------------------------------------------------------------------------------*/
//int main()
//{
//    int arr[15] = {};//массив
//    cout << "Print your array: ";
//    for (int i = 0; i < 15; i++)
//    {
//        cin >> arr[i];//вводим массив
//        if (arr[i] < -10 || arr[i] > 10)//проверяем на условие
//        {
//            cout << "\nError! Try again!\n";
//            i--;
//        }
//    }
//    cout << "Before sort:";
//    for (int i = 0; i < 15; i++)//выводим массив
//    {
//        cout << " ";
//        cout << arr[i];
//    }
//    qsort(arr, 15, sizeof(int), sort);//вызываем сортировку
//    cout << "\nAfter sort:";
//    for (int i = 0; i < 15; i++)//выводим отсортированный массив
//    {
//        cout << " ";
//        cout << arr[i];
//    }
//
//	return 0;
//}
/*----------------------------------------------------------------------------------------------------------------*/

// Лаб. 4 Задание 3
/*----------------------------------------------------------------------------------------------------------------*/
//int main()
//{
//	setlocale(LC_ALL, "Russian");
//
//	const int n = 5;
//	int arr1[n] = { 1, 2, 3, 4, 5 }, arr2[n] = { 0, 0, 0, 0, 0 };
//
//	for (int i = 0; i < n; i++)
//	{
//		if (abs(arr1[i]) > 1)
//		{
//			arr2[i] = arr1[i];
//		}
//	}
//
//	cout << "Преобразованный массив: ";
//	for (int i = 0; i < n; i++)
//	{
//		cout << arr2[i] << " ";
//	}
//
//	return 0;
//}
/*----------------------------------------------------------------------------------------------------------------*/

// Лаб. 4 Задание 2
/*----------------------------------------------------------------------------------------------------------------*/
//int main()
//{
//	setlocale(LC_ALL, "Russian");
//
//	const int sise = 10;
//	int ibeg = 0, iend = 0;
//	float arr[sise] = {}, summ = 0, sumIbegIend = 0;
//
//	for (int i = 0; i < sise; i++)
//	{
//		cout << "Введите элемент массива [" << i + 1 << "]: ";
//		cin >> arr[i];
//	}
//
//	for (int i = 0; i < sise; i++)
//	{
//		if (i % 2 != 0)
//		{
//			summ += arr[i];
//		}
//	}
//	
//	cout << "Сумма элементов массива с нечетными номерами равна: " << summ << endl;
//
//	for (int i = 0; i < sise; i++)
//	{
//		if (arr[i] < 0)
//		{
//			ibeg = i;
//			break;
//		}
//	}
//
//	for (int i = ibeg+1; i < sise; i++)
//	{
//		if (arr[i] < 0)
//		{
//			iend = i;
//		}
//	}
//
//	for (int i = ibeg+1; i < iend; i++)
//	{
//		sumIbegIend += arr[i];
//	}
//
//	cout << "Сумма между первым и последним отрецательными элементами: " << sumIbegIend;
//
//	return 0;
//}
/*----------------------------------------------------------------------------------------------------------------*/


// Лаб. 4 Задание 1
/*----------------------------------------------------------------------------------------------------------------*/
//int main()
//{
//    setlocale(LC_ALL, "Russian");
//
//    int arr[10] = {}, size = 10;
//
//    for (int i = 0; i < size; i++)
//    {
//        cout << "Введите элемент массива [" << i + 1 << "]: ";
//        cin >> arr[i];
//    }
//
//    for (int i = 0; i < size - 1; i++)
//    {
//        if (arr[i] > arr[i + 1])
//        {
//            cout << "Массив не упорядочен" << ends;
//            return 0;
//        }
//    }
//    cout << "Массив упорядочен" << ends;
//
//	return 0;
//}
/*----------------------------------------------------------------------------------------------------------------*/